<?php

namespace App\classes;

class News
{
    protected $allnews;
    protected $result=[];
    public function index(){
        return[
            0=>[
                'id'=>1,
                'newsid'=>1,
                'name'=>'Bangladesh',
                'Titel'=>'বাপার আলোচনা সভা সুন্দরবনকে ধীরে ধীরে মেরে ফেলা হচ্ছে',
                'description'=>'ঘূর্ণিঝড়ের মতো প্রাকৃতিক দুর্যোগের বড় আঘাত থেকে সুন্দরবন বাংলাদেশকে রক্ষা করে। জলবায়ু পরিবর্তনজনিত পরিস্থিতিতে এই বনকে রক্ষা করা',
                'image'=>'assets/img/b1.jfif',
            ],
            1=>[
                'id'=>2,
                'newsid'=>1,
                'name'=>'Bangladesh',
                'Titel'=>'ইসি গঠনে যাঁদের নাম, কোন পেশার কতজন',
                'description'=>'নির্বাচন কমিশন (ইসি) গঠনের জন্য বিভিন্ন রাজনৈতিক দল, সংগঠন ও ব্যক্তি অনুসন্ধান কমিটির কাছে নাম জমা দিয়েছে। কমিটি সোমবা',
                'image'=>'assets/img/b2.jpg',
            ],
            2=>[
                'id'=>3,
                'newsid'=>1,
                'name'=>'world',
                'Titel'=>'রাস্তায় ম্যাজিস্ট্রেটকে মারধর করে আটক প্রবাসী',
                'description'=>'পুলিশ কর্মকর্তা মোখলেসুর রহমান বলেন, নগরের জিইসি মোড় এলাকায় স্ত্রীকে নিয়ে হাঁটছিলেন ওই ম্যাজিস্ট্রেট। এ সময় একটি',
                'image'=>'assets/img/b3.jpg',
            ],
            3=>[
                'id'=>4,
                'newsid'=>2,
                'name'=>'world',
                'Titel'=>'কিয়েভ ও মস্কো সফরে জার্মান চ্যান্সেলর',
                'description'=>'ইউক্রেন সংকট নিরসনে এক সপ্তাহ ধরে কূটনৈতিক প্রচেষ্টা চলছে। এ প্রচেষ্টার অংশ হিসেবে গতকাল জার্মান চ্যান্সেলর ওলাফ শলৎ',
                'image'=>'assets/img/w1.jpg',
            ],
            4=>[
                'id'=>5,
                'newsid'=>2,
                'name'=>'world',
                'Titel'=>'বিচিত্র বিক্ষোভ ছত্রভঙ্গে সংগীত',
                'description'=>'করোনা মহামারি মোকাবিলায় এ পর্যন্ত যেসব দেশ সফল, তাদের অন্যতম নিউজিল্যান্ড। সংক্রমণ মোকাবিলায় কঠোর পদক্ষেপও নিয়েছে',
                'image'=>'assets/img/w2.jfif',
            ],
            5=>[
                'id'=>6,
                'newsid'=>2,
                'name'=>'Bangladesh',
                'Titel'=>'কিয়েভ থেকে সরিয়ে নেওয়া হচ্ছে মার্কিন দূতাবাস',
                'description'=>'মার্কিন দূতাবাস কিয়েভ থেকে সরিয়ে নেওয়া হলেও ইউক্রেন সরকারের সঙ্গে কার্যক্রম চালিয়ে যাওয়া হবে বলে জানিয়েছেন ব্লিঙ্কেন। তিনি',
                'image'=>'assets/img/w3.jpg',
            ],
            6=>[
                'id'=>7,
                'newsid'=>3,
                'name'=>'business',
                'Titel'=>'মিয়ানমারে ব্যবসা বন্ধ করছে জাপানের কিরিন',
                'description'=>'মিয়ানমার থেকে ব্যবসা গুটিয়ে নেওয়ার ঘোষণা দিয়েছে জাপানের বহুজাতিক পানীয় প্রস্তুতকারক প্রতিষ্ঠান কিরিন হোল্ডিংস। সোমবার এক',
                'image'=>'assets/img/bs1.jpg',
            ],
            7=>[
                'id'=>8,
                'newsid'=>3,
                'name'=>'business',
                'Titel'=>'ফ্রেশ সিমেন্টের উদ্যোগে দেশে বিশেষ শহীদ মিনার',
                'description'=>'একুশে ফেব্রুয়ারি শহীদ দিবস ও আন্তর্জাতিক মাতৃভাষা দিবস। ইতিহাসের সেই গৌরবোজ্জ্বল সংগ্রাম ও আত্মত্যাগের কথা স্মরণ করে দেশের',
                'image'=>'assets/img/bs2.png',
            ],
            8=>[
                'id'=>9,
                'newsid'=>3,
                'name'=>'business',
                'Titel'=>'ইইউতে বাজার হারাচ্ছে যুক্তরাজ্য',
                'description'=>'ব্রেক্সিটের মাধ্যমে ইউরোপীয় ইউনিয়ন (ইইউ) থেকে যুক্তরাজ্যের বের হয়ে আসা এবং বৈশ্বিক করোনা পরিস্থিতির কারণেই দেশটির রপ্তানির',
                'image'=>'assets/img/bs3.jpg',
            ]
        ];
    }

    public function newses($newsid){
        $this->allnews=$this->index();
        foreach ($this->allnews as $news){
            if ($news['newsid']==$newsid){
                array_push($this->result,$news);
            }
        }
        return $this->result;

    }

}